Reports/бит_ОтчетыГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ОтчетыГЦЖС</Name>
			<Comment>Отчеты ГЦЖС</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправляющаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыУправляющихОрганизация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииПоГЦЖС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОтчета</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОДН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_ОтчетыГЦЖС/Forms/НастройкаПараметровСохраненияРегламентированногоОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодОрганизацииПоГЦЖС = Параметры.КодОрганизацииПоГЦЖС;
	ИмяФайла = Параметры.ИмяФайла;
	Формат = Параметры.Формат;
	ПутьДляВыгрузки = Параметры.ПутьДляВыгрузки;
	
    // БИТ ЖКХ 20.04.2021
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ПроверитьЗаполнениеРегистра();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СокрЛП(ПутьДляВыгрузки)="" Тогда
		
		Если СокрЛП(ПутьДляВыгрузки) = "" Тогда
			
			// БИТ_ЖКХ 07.02.2014
			Отчет.Организация = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			
			ПутьДляВыгрузки = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойКаталогФайлов",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			// БИТ_ЖКХ 07.02.2014
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Лев(ПутьДляВыгрузки, 2) <> "\\" Тогда
		
		// Если при указании пути для выгрузки вручную не указан концевой слэш - добавляем его.
		Если Прав(ПутьДляВыгрузки, 1) <> "\" Тогда
			ПутьДляВыгрузки = ПутьДляВыгрузки + "\";
		КонецЕсли;
		
		Кат = Новый Файл(ПутьДляВыгрузки + "NUL");
		
		Если НЕ Кат.Существует() Тогда
			
			Текст = "Нет доступа к каталогу " + ПутьДляВыгрузки + ".";
			
			Текст = Текст + Символы.ПС + "Проверьте корректность имени каталога выгрузки!";
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СохранитьЗавершение3", ЭтотОбъект), Текст);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Формат) Тогда
		
		Текст = "Не выбран формат выгрузки.";
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СохранитьЗавершение2", ЭтотОбъект), Текст);
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Текст = "Не указанно имя файла.";
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СохранитьЗавершение1", ЭтотОбъект), Текст);
		Возврат;
		
	КонецЕсли; 
	
	Кат = Новый Файл(ПутьДляВыгрузки);
	Если Кат.Существует() и Кат.ЭтоКаталог() Тогда
		
		ЭтаФорма.Закрыть(Истина);
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СохранитьЗавершение", ЭтотОбъект), "Имя каталога задано неверно! Проверьте правильность указания имени каталога!");
		Возврат;
	КонецЕсли;
	
	СохранитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗавершение3(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗавершение2(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗавершение(ДополнительныеПараметры) Экспорт
	
	СохранитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФрагмент()
	
	Перем ПараметрыОповещения;	
		
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("КодОрганизацииПоГЦЖС",КодОрганизацииПоГЦЖС);	
	ПараметрыОповещения.Вставить("ИмяФайла",ИмяФайла);	
	ПараметрыОповещения.Вставить("Формат",Формат);	
	ПараметрыОповещения.Вставить("ПутьДляВыгрузки",ПутьДляВыгрузки);	
	
	Оповестить("СохранитьНастройки",ПараметрыОповещения,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ЭтаФорма.Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Длг.Заголовок = "Укажите каталог";
	Если Длг.Выбрать() Тогда
		ПутьДляВыгрузки = Длг.Каталог+?(Прав(Длг.Каталог, 1) <> "\", "\", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	НастройкиПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаполнениеПоУмолчанию();
КонецПроцедуры

#КонецОбласти
